cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-cask-fonts'
tap 'homebrew/cask-cask-drivers'

brew 'ack'
brew 'bchunk'
brew 'blueutil'
brew 'coreutils'
brew 'ffmpeg'
brew 'gbevin/tools/sendmidi'
brew 'glow'
brew 'grc'
brew 'homebrew/cask/mediainfo'
brew 'ical-buddy'
brew 'imagemagick'
brew 'libusb'
brew 'locateme'
brew 'navi'
brew 'neofetch'
brew 'node'
brew 'openssl'
brew 'pyenv'
brew 'shellcheck'
brew 'shfmt'
brew 'somafm'
brew 'switchaudio-osx'
brew 'terminal-notifier'
brew 'thefuck'
brew 'tiptop'
brew 'wget'
brew 'yabai'
brew 'youtube-dl'

# Apps

cask 'audacity'
cask 'blackhole-2ch'
cask 'discord'
cask 'plexamp'
cask 'skype'
cask 'the-clock'
cask 'alfred'
cask 'batchmod'
# cask 'bettertouchtool'
cask 'colorpicker-skalacolor'
cask 'cyberduck'
cask 'figma'
cask 'google-chrome'
cask 'handbrake'
cask 'iina'
cask 'iterm2'
cask 'imageoptim'
cask 'jdownloader'
cask 'karabiner-elements'
cask 'kicad'
cask 'numi'
cask 'private-internet-access'
cask 'simple-comic'
cask 'soda-player'
cask 'sony-ps4-remote-play'
cask 'spotify'
cask 'syntax-highlight'
cask 'tidal'
cask 'the-unarchiver'
cask 'torbrowser'
cask 'vscodium'
cask 'xld'

# Quicklook plugins (https://github.com/sindresorhus/quick-look-plugins#install-all)
brew 'iloveitaly/tap/qlzipinfo'
cask 'qlmobi'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlimagesize'
cask 'qlvideo'
cask 'quicklookase'
cask 'suspicious-package'
cask 'webpquicklook'

# Fonts
brew 'font-jetbrains-mono-nerd-font'
brew 'font-roboto-mono-nerd-font'
brew 'font-iosevka-term-nerd-font'
brew 'font-iosevka-term-nerd-font'
brew 'font-fira-code-nerd-font'
brew 'font-hack-nerd-font'