tap "alienator88/cask"
tap "bloznelis/tap"
tap "felixkratz/formulae"
tap "gbevin/tools"
tap "homebrew/bundle"
tap "homebrew/services"
tap "iloveitaly/tap"
tap "jmattaa/laser"
tap "keith/formulae"
tap "koekeishiya/formulae"
tap "popcorn-official/popcorn-desktop", "https://github.com/popcorn-official/popcorn-desktop.git"
tap "smudge/smudge"
brew "ack"
brew "xz"
brew "openssl@3"
brew "automake"
brew "bchunk"
brew "bison"
brew "blueutil"
brew "btop"
brew "readline"
brew "coreutils"
brew "cask"
brew "chruby"
brew "fish"
brew "chruby-fish"
brew "curl"
brew "eza"
brew "fastfetch"
brew "harfbuzz"
brew "tesseract"
brew "ffmpeg"
brew "gdbm"
brew "glow"
brew "ical-buddy"
brew "imagemagick"
brew "jq"
brew "libffi"
brew "libusb"
brew "libyaml"
brew "lla"
brew "locateme"
brew "lsusb"
brew "midnight-commander"
brew "navi"
brew "nmap"
brew "node"
brew "p7zip"
brew "php"
brew "pkgconf"
brew "pngpaste"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "ruby"
brew "ruby-install"
brew "shellcheck"
brew "shfmt"
brew "switchaudio-osx"
brew "syncthing", restart_service: :changed
brew "telnet"
brew "terminal-notifier"
brew "tiger-vnc"
brew "transmission-cli"
brew "unar"
brew "wget"
brew "wtfutil"
brew "yt-dlp"
brew "bloznelis/tap/typioca"
brew "felixkratz/formulae/sketchybar", args: ["HEAD"]
brew "gbevin/tools/receivemidi"
brew "gbevin/tools/sendmidi"
brew "keith/formulae/reminders-cli"
brew "koekeishiya/formulae/yabai"
brew "smudge/smudge/nightlight"
cask "font-3270-nerd-font"
cask "font-crimson-pro"
cask "font-departure-mono-nerd-font"
cask "font-sf-pro"
cask "jdownloader", args: { appdir: "/Applications" }
cask "karabiner-elements", args: { appdir: "/Applications" }
cask "launchcontrol", args: { appdir: "/Applications" }
cask "obsidian"
cask "private-internet-access", args: { appdir: "/Applications" }
cask "sentinel-app"
cask "sf-symbols"
cask "sonos"
cask "vscodium"
