cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/fonts'
tap 'caskroom/drivers'

brew 'ack'
brew 'bchunk'
brew 'coreutils'
brew 'ffmpeg'
brew 'grc'
brew 'imagemagick'
brew 'locateme'
brew 'node'
brew 'openssl'
brew 'spark'
brew 'switchaudio-osx'
brew 'terminal-notifier'
brew 'tvnamer'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'

# Apps
cask '1password'
cask 'a-better-finder-rename'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'batchmod'
cask 'bettertouchtool'
cask 'calibre'
cask 'craftmanager'
cask 'discord'
cask 'dropbox'
cask 'flixtools'
cask 'google-chrome'
cask 'handbrake'
cask 'hazel'
cask 'iconjar'
cask 'icons8'
cask 'iina'
cask 'imageoptim'
cask 'jdownloader'
cask 'launchcontrol'
cask 'numi'
cask 'private-internet-access'
cask 'rightfont'
cask 'simple-comic'
cask 'sip'
cask 'sketch'
cask 'skype'
cask 'slack'
cask 'soda-player'
cask 'sonos'
cask 'sony-ps4-remote-play'
cask 'spotify'
cask 'sublime-text'
cask 'the-clock'
cask 'the-unarchiver'
cask 'torbrowser'
cask 'transmit'
# cask 'ubersicht'
cask 'virtualbox'
cask 'vlc'
cask 'webtorrent'
cask 'wineskin-winery'
cask 'xld'

# Quicklook plugins (https://github.com/sindresorhus/quick-look-plugins#install-all)
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

# Fonts
cask 'font-inconsolata'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-mono'
cask 'font-roboto-slab'
cask 'font-robotomono-nerd-font'